royeilam/miniOs_GNU/hw_drivers/msp432_addr_map.h
/*
 * msp432_addr_map.h
 *
 *  Created on: 3 Oct 2020
 *      Author: roy
 */

#ifndef MSP432_ADDR_MAP_H_
#define MSP432_ADDR_MAP_H_

#define TIMER_A0_OFFSET 0x40000000U
#define TIMER_A1_OFFSET 0x40000400U
#define TIMER_A2_OFFSET 0x40000800U
#define TIMER_A3_OFFSET 0x40000C00U
#define EUSCI_A0_OFFSET 0x40001000U
#define EUSCI_A1_OFFSET 0x40001400U
#define EUSCI_A2_OFFSET 0x40001800U
#define EUSCI_A3_OFFSET 0x40001C00U
#define EUSCI_B0_OFFSET 0x40002000U
#define EUSCI_B1_OFFSET 0x40002400U
#define EUSCI_B2_OFFSET 0x40002800U
#define EUSCI_B3_OFFSET 0x40002C00U
#define REF_ATAB_OFFSET 0x40003000U
#define COMP_E0_OFFSET 0x40003400U
#define COMP_E1_OFFSET 0x40003800U
#define AES256_OFFSET 0x40003C00U
#define CRC32_OFFSET 0x40004000U
#define RTC_C_OFFSET 0x40004400U
#define WDT_A_OFFSET 0x40004800U
#define PORT_MODULE_OFFSET 0x40004C00U
#define PORT_MAPPING_CONTROLLER_OFFSET 0x40005000U
#define CAPACITIVE_TOUCH_I_O_0_OFFSET 0x40005400U
#define CAPACITIVE_TOUCH_I_O_1_OFFSET 0x40005800U
#define TIMER32_OFFSET 0x4000C000U
#define DMA_OFFSET 0x4000E000U
#define PCM_OFFSET 0x40010000U
#define CS_OFFSET 0x40010400U
#define PSS_OFFSET 0x40010800U
#define FLCTL_OFFSET 0x40011000U
#define PRECISION_ADC_OFFSET 0x40012000U

#endif /* MSP432_ADDR_MAP_H_ */
